
__author__ = 'Лелянов Иван Александрович'

# Задание-1: уравнение прямой вида y = kx + b задано в виде строки.
# Определить координату y точки с заданной координатой x.
# вычислите и выведите y
# например, equation = 'y = -12x + 11111140.2121'

equation = 'y = -12x + 11111140.2121'
x = float(input("Введите значение x для уравнения 'y = -12x + 11111140.2121': "))
k = float(equation[(equation.find('y') + 4):equation.find('x')])
b = float(equation[(equation.find('x') +4):])
print(f'y = {k * x + b}')